# LightingDevice Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightingDevice Properties
LightingDevice Class See Also
---
The LightingDevice type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectorManager | Retrieves the Connector Manager from this MEPModel.  (Inherited from MEPModel.) |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from MEPModel.) |

# See Also
LightingDevice Class
Autodesk.Revit.DB.Electrical Namespace